bit-finance/InformationRegisters/ДокументыОПредстоящейПоставке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыОПредстоящейПоставке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеДОПП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаВвоза</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПодакцизногоТовара</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДОПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/InformationRegisters/ДокументыОПредстоящейПоставке/Forms/РабочееМесто/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Период = ТекущаяДатаСеанса();
	
	ОбщегоНазначенияУТ.ОбработкаЗаполнения(ЭтотОбъект, Новый Структура, СтандартнаяОбработка);
	
	СписокДОПП.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	
	СтатьиДоходовБюджетаРФ = ЕдиныйНалоговыйСчет.КБКПоВидамНалогов(ТекущаяДатаСеанса());
	КодБКНДСВидНалога = СтатьиДоходовБюджетаРФ.Получить(Справочники.ВидыНалоговВзносов.НДС_ВвозимыеТовары);
	КодБКНДС = РегистрыСведений.ДокументыОПредстоящейПоставке.УточнитьКБК(КодБКНДСВидНалога.Получить(0));
	КодыБК.Загрузить(РегистрыСведений.ДокументыОПредстоящейПоставке.ПолучитьКодыБК(КодБКНДС));
	КБКПоКатегориям.Загрузить(РегистрыСведений.ДокументыОПредстоящейПоставке.ПолучитьКБКПоКатегориямТоваров());
	
	УстановитьУсловноеОформление();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененияПоДОПП" Тогда
		
		Элементы.СписокДОПП.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСостояние(Команда)
	
	ТекущиеДанные = Элементы.СписокДОПП.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru = 'Не выбран документ о предстоящей поставке';
								|en = 'Не выбран документ о предстоящей поставке'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// Получаем массив идентификаторов выделенных строк
	МассивИД = Элементы.СписокДОПП.ВыделенныеСтроки;
	МассивВыделенныхСтрок = Новый Массив();
	// Обходим массив и получаем данные по каждому идентификатору
	Для Каждого Идентификатор Из МассивИД Цикл
		ДанныеСтроки = Элементы.СписокДОПП.ДанныеСтроки(Идентификатор);
		// Обязательно проверяем на Неопределено (данные могут быть не загружены в кэш)
		Если ДанныеСтроки <> Неопределено Тогда
			МассивВыделенныхСтрок.Добавить(ДанныеСтроки)
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("Состояние",   ТекущиеДанные.Состояние);
	
	ДатаСобытия = ?(ЗначениеЗаполнено(ТекущиеДанные.ДатаСобытия), ТекущиеДанные.ДатаСобытия, Период);
	ПараметрыФормы.Вставить("ДатаСобытия", ДатаСобытия);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборСостоянияЗавершение", ЭтотОбъект, МассивВыделенныхСтрок);
	ОткрытьФорму("РегистрСведений.ДокументыОПредстоящейПоставке.Форма.УстановкаСостоянияДОПП",
				ПараметрыФормы,
				ЭтотОбъект,
				"УстановкаСостояние",
				,,
				ОписаниеОповещения,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДОППКОбработке(Команда)
	
	ПоказатьДОППКОбработкеКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСведенияИзФНС(Команда)
	
	ДлительнаяОперация = НачатьзагрузкуСведенийНаСервере();

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузкаЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СписокДОПП.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДОПП

&НаКлиенте
Процедура СписокДОПППередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;

	Отказ = Истина; // Прерываем стандартный процесс создания нового элемента
	
	КодыБКМассив = Новый Массив();
	Для Каждого КБК Из КодыБК Цикл
		СтруктураСтроки = Новый Структура();
		СтруктураСтроки.Вставить("Код",      КБК.Код);
		СтруктураСтроки.Вставить("Название", КБК.Название);
		КодыБКМассив.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("КодыБК",      КодыБКМассив);
	ПараметрыФормы.Вставить("КодБКНДС",     КодБКНДС);
		
	ОткрытьФорму("РегистрСведений.ДокументыОПредстоящейПоставке.Форма.ФормаЗаписи", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьДОППКОбработкеКлиент()
	
	Если ДОППКОбработке Тогда
		ЗаголовокТекст = НСтр("ru = 'Ожидается поставка';
								|en = 'Ожидается поставка'");
		ПолеОтбора = Новый ПолеКомпоновкиДанных("Состояние");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокДОПП,
			ПолеОтбора,
			,
			,
			,
			Ложь);
	Иначе
		ЗаголовокТекст = НСтр("ru = 'Все документы';
								|en = 'Все документы'");
		ПолеОтбора = Новый ПолеКомпоновкиДанных("Состояние");
		ЗначениеОтбора = ПредопределенноеЗначение("Перечисление.СостояниеДОПП.ПустаяСсылка");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокДОПП,
			ПолеОтбора,
			ЗначениеОтбора,
			ВидСравненияКомпоновкиДанных.Равно,
			,
			Истина);
	КонецЕсли;
	
	Элементы.ПоказатьДОППКОбработке.Заголовок = ЗаголовокТекст;
	ДОППКОбработке = Не ДОППКОбработке;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзменения(МассивСтрок, НовыеЗначения)
	
	МетаданныеРегистра    = Метаданные.РегистрыСведений.ДокументыОПредстоящейПоставке;
	ПолноеИмяРегистра     = МетаданныеРегистра.ПолноеИмя();
	
	Для Каждого Строка Из МассивСтрок Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра);
			ЭлементБлокировки.УстановитьЗначение("Организация", НовыеЗначения.Организация);
			ЭлементБлокировки.УстановитьЗначение("НомерДОПП",   Строка.НомерДОПП);
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.ДокументыОПредстоящейПоставке.СоздатьНаборЗаписей();
			НаборЗаписей.Заполнить(Неопределено);
			НаборЗаписей.Отбор.Организация.Установить(НовыеЗначения.Организация);
			НаборЗаписей.Отбор.НомерДОПП.Установить(Строка.НомерДОПП);
			НаборЗаписей.Отбор.КБК.Установить(Строка.КБК);
			НаборЗаписей.Отбор.ДатаСобытия.Установить(Строка.ДатаСобытия);
			
			НаборЗаписей.Записать();
			
			НаборЗаписей = РегистрыСведений.ДокументыОПредстоящейПоставке.СоздатьНаборЗаписей();
			НаборЗаписей.Заполнить(Неопределено);
			НаборЗаписей.Отбор.Организация.Установить(НовыеЗначения.Организация);
			НаборЗаписей.Отбор.НомерДОПП.Установить(Строка.НомерДОПП);
			НаборЗаписей.Отбор.КБК.Установить(Строка.КБК);
			НаборЗаписей.Отбор.ДатаСобытия.Установить(НовыеЗначения.ДатаСобытия);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Строка);
			ЗаполнитьЗначенияСвойств(НоваяЗапись, НовыеЗначения);
			
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию();
				
		Исключение
				
			ОтменитьТранзакцию();
				
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось записать изменения по ДОПП №%1 по причине:
				|%2';
				|en = 'Не удалось записать изменения по ДОПП №%1 по причине:
				|%2'"), Строка.НомерДОПП, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСостоянияЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьИзменения(ДопПараметры, РезультатВыбора);
	
	Элементы.СписокДОПП.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокДОППСостояние.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокДОПП.Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Поставка ожидается';
																|en = 'Поставка ожидается'"));

	ОтборЭлемента.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Функция НачатьзагрузкуСведенийНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	ПараметрыПолученияДанных = Новый Структура();
	ПараметрыПолученияДанных.Вставить("Организация",     Организация);
	ПараметрыПолученияДанных.Вставить("КБКПоКатегориям", КБКПоКатегориям.Выгрузить());
	ПараметрыПолученияДанных.Вставить("КодБКНДС",        КодБКНДС);
	
	ИмяФункции = "РегистрыСведений.ДокументыОПредстоящейПоставке.ПолучитьНомераДОПП";
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		ИмяФункции, ПараметрыПолученияДанных);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузкаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	ОбновитьФорму = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если ОбновитьФорму Тогда
		Элементы.СписокДОПП.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
